# Создать множество произвольного содержания.
# После каждой операции выводить множество на экран
# Добавить 34 во множество.
# Удалить 34 из множества

my_set = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10}
my_set.add(34)
print(my_set)
my_set.remove(34)
print(my_set)
