# Создать список произвольного содержания.
# Вывести на экран третий, пятый и шестой элементы

my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(my_list[2], my_list[4], my_list[5])
