# Дана длина ребра куба. Найти объем куба и площадь всей его поверхности.

rebro = 8
v = rebro ** 3
s = rebro ** 2 * 6
print(f' объем куба с ребром {rebro} равна {v}, /'
      f'а площадь всей его поверхности {s}')
