# Найти значение выражений
# x = 17 / 2 * 3 + 2
# x = 2 + 17 / 2 * 3
# x = 19 % 4 + 15 / 2  * 3
# x = (15 + 6) - 10 * 4
# x = 17 / 2 % 2 * 3**3
#
# Расставить скобки, чтобы значение выражений не поменялось

x = 17 / 2 * 3 + 2
print(x)
x = 2 + 17 / 2 * 3
print(x)
x = 19 % 4 + 15 / 2 * 3
print(x)
x = (15 + 6) - 10 * 4
print(x)
x = 17 / 2 % 2 * 3 ** 3
print(x)

print("-" * 10)

x = (((17 / 2) * 3) + 2)
print(x)
x = (2 + ((17 / 2) * 3))
print(x)
x = ((19 % 4) + ((15 / 2) * 3))
print(x)
x = ((15 + 6) - (10 * 4))
print(x)
x = (((17 / 2) % 2) * (3 ** 3))
print(x)
