# Определить переменные всех 4 базовых типов и вывести их на экран

a = 5
b = 3.14
c = True
d = "hello Alex from Maks"
print(f'{a}, {b}, {c}, {d}')
