# Даны действительные числа x и y. Получить
#
# Для нахождения модуля использовать функцию abs(..)

x = 50
y = 60

result = (abs(x) - abs(y)) / (1 + abs(x * y))
print(result)
