# Ввести с клавиатуры имя пользователя.
# Вывести на экран “Hello, [name]!”

name = input('enter your name ')
print(f"Hello, {name}")
