# Даны 2 действительных числа a и b.
# Получить их сумму, разность и произведение.

number_1 = 50
number_2 = 60

print(f"sum - {number_1 + number_2}, /difference /"
      f"- {number_1 - number_2}, proizvedenie /"
      f"- {number_1 * number_2}")
