# Создать три переменные, содержащие возраст
# трех ближайших соседей, найти сумму и вывести ее на экран.
# Создать еще одну переменную равную среднему арифметическому
# возрасту, и вывести это значение на экран


alex_age = 32
denis_age = 25
sery_age = 45
total_age = alex_age + denis_age + sery_age
print(total_age)
avg_age = total_age / 3
print(avg_age)
