# Выведите на экран n раз фразу "Silence is golden".
# Число n вводит пользователь.

n = int(input('enter n - '))
while n:
    print("Silence is golden")
    n -= 1
