# Написать произвольную строку. Получить подстроку, которая начинается
# с пятого символа, заканчивается предпредпоследним символом с шагом три.

my_string = "1234567890asdfg"
abgrade_my_string = my_string[4:-1:3]
print(abgrade_my_string)
