# Создать произвольную строку. Получить подстроку с
# начала и до седьмого элемента. Написать два решения
# с использованием полной и сокращенной записи.

my_string = '0123456789'
abgrade_my_string = my_string[0:6:1]
super_abgrade_my_string = my_string[:6]
print(abgrade_my_string, super_abgrade_my_string)
