# Создать lambda функцию, которая принимает на
# вход имя и выводит его в формате “Hello, {name}”

print((lambda name: f'hello {name}')('maks'))
